Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: فهل ينظرون إلا الساعة أن تأتيهم بغتة فقد جاء أشراطها فأنى لهم إذا جاءتهم ذكراهم
en: Do they then await (anything) other than the Hour, that it should come upon them suddenly? But some of its portents (indications and signs) have already come; and when it (actually) is on them, how can they benefit then by their reminder?

source: فاعلم أنه لا إله إلا الله واستغفر لذنبك وللمؤمنين والمؤمنات والله يعلم متقلبكم ومثواكم
en: So know (O Muhammad صلى الله عليه وسلم) that, La ilaha illallah (none has the right to be worshipped but Allah) , and ask forgiveness for your sin, and also for (the sin of) believing men and believing women. And Allah knows well your moving about, and your place of rest (in your homes).

source: ويقول الذين آمنوا لولا نزلت سورة فإذا أنزلت سورة محكمة وذكر فيها القتال رأيت الذين في قلوبهم مرض ينظرون إليك نظر المغشي عليه من الموت فأولى لهم
en: Those who believe say: "Why is not a Surah (chapter of the Qur'an) sent down (for us)? But when a decisive Surah (explaining and ordering things) is sent down, and fighting (Jihad - holy fighting in Allah's cause) is mentioned (i.e. ordained) therein, you will see those in whose hearts is a disease (of hypocrisy) looking at you with a look of one fainting to death. But it was better for them (hypocrites, to listen to Allah and to obey Him).

source: طاعة وقول معروف فإذا عزم الأمر فلو صدقوا الله لكان خيرا لهم
en: Obedience (to Allah) and good words (were better for them). And when the matter (preparation for Jihad ) is resolved on, then if they had been true to Allah, it would have been better for them.

source: فهل عسيتم إن توليتم أن تفسدوا في الأرض وتقطعوا أرحامكم
en: Would you then, if you were given the authority, do mischief in the land, and sever your ties of kinship?

source: أولئك الذين لعنهم الله فأصمهم وأعمى أبصارهم
en: Such are they whom Allah has cursed, so that He has made them deaf and blinded their sight.

source: أفلا يتدبرون القرآن أم على قلوب أقفالها
en: Do they not then think deeply in the Qur'an, or are their hearts locked up (from understanding it)?

source: إن الذين ارتدوا على أدبارهم من بعد ما تبين لهم الهدى الشيطان سول لهم وأملى لهم
en: Verily, those who have turned back (have apostatised) as disbelievers after the guidance has been manifested to them - Shaitan (Satan) has beautified for them (their false hopes), and (Allah) prolonged their term (age).

source: ذلك بأنهم قالوا للذين كرهوا ما نزل الله سنطيعكم في بعض الأمر والله يعلم إسرارهم
en: This is because they said to those who hate what Allah has sent down: "We will obey you in part of the matter." But Allah knows their secrets.

source: فكيف إذا توفتهم الملائكة يضربون وجوههم وأدبارهم
en: Then how (will it be) when the angels will take their souls at death, smiting their faces and their backs?

source: ذلك بأنهم اتبعوا ما أسخط الله وكرهوا رضوانه فأحبط أعمالهم
en: That is because they followed that which angered Allah and hated that which pleased Him. So He made their deeds fruitless.

source: أم حسب الذين في قلوبهم مرض أن لن يخرج الله أضغانهم
en: Or do those in whose hearts is a disease (of hypocrisy), think that Allah will not bring to light all their hidden ill-wills?

source: ولو نشاء لأريناكهم فلعرفتهم بسيماهم ولتعرفنهم في لحن القول والله يعلم أعمالكم
en: Had We willed, We could have shown them to you, and you should have known them by their marks; but surely, you will know them by the tone of their speech! And Allah knows (all) your deeds.

source: ولنبلونكم حتى نعلم المجاهدين منكم والصابرين ونبلو أخباركم
en: And surely, We shall try you till We test those who strive hard (for the Cause of Allah) and As-Sabirun (the patient), and We shall test your facts (i.e. the one who is a liar, and the one who is truthful).

source: إن الذين كفروا وصدوا عن سبيل الله وشاقوا الرسول من بعد ما تبين لهم الهدى لن يضروا الله شيئا وسيحبط أعمالهم
en: Verily, those who disbelieve, and hinder (men) from the Path of Allah (i.e. Islam), and oppose the Messenger (صلى الله عليه وسلم) (by standing against him and hurting him), after the guidance has been clearly shown to them, they will not harm Allah in the least, but He will make their deeds fruitless,

source: يا أيها الذين آمنوا أطيعوا الله وأطيعوا الرسول ولا تبطلوا أعمالكم
en: O you who believe! Obey Allah, and obey the Messenger (Muhammad صلى الله عليه وسلم) and render not vain your deeds.

source: إن الذين كفروا وصدوا عن سبيل الله ثم ماتوا وهم كفار فلن يغفر الله لهم
en: Verily, those who disbelieve, and hinder (men) from the Path of Allah (i.e. Islam); then die while they are disbelievers - Allah will not forgive them.

source: فلا تهنوا وتدعوا إلى السلم وأنتم الأعلون والله معكم ولن يتركم أعمالكم
en: So be not weak and ask not for peace (from the enemies of Islam) while you are having the upper hand. Allah is with you, and He will never decrease the reward of your good deeds.

source: إنما الحياة الدنيا لعب ولهو وإن تؤمنوا وتتقوا يؤتكم أجوركم ولا يسألكم أموالكم
en: The life of this world is but play and pastime; but if you believe (in the Oneness of Allah - Islamic Monotheism), and fear Allah, and avoid evil, He will grant you your wages, and will not ask you your wealth.

source: إن يسألكموها فيحفكم تبخلوا ويخرج أضغانكم
en: If He were to ask you of it, and press you, you would covetously withhold, and He will bring out all your (secret) ill-wills.

source: ها أنتم هؤلاء تدعون لتنفقوا في سبيل الله فمنكم من يبخل ومن يبخل فإنما يبخل عن نفسه والله الغني وأنتم الفقراء وإن تتولوا يستبدل قوما غيركم ثم لا يكونوا أمثالكم
en: Behold! You are those who are called to spend in the Cause of Allah, yet among you are some who are niggardly. And whoever is niggardly, it is only at the expense of his ownself. But Allah is Rich (Free of all needs), and you (mankind) are poor. And if you turn away (from Islam and the obedience to Allah), He will exchange you for some other people and they will not be your likes.

source: إنا فتحنا لك فتحا مبينا
en: Verily, We have given you (O Muhammad صلى الله عليه وسلم) a manifest victory.

source: ليغفر لك الله ما تقدم من ذنبك وما تأخر ويتم نعمته عليك ويهديك صراطا مستقيما
en: That Allah may forgive you your sins of the past and the future, and complete His Favour on you, and guide you on the Straight Path,

source: وينصرك الله نصرا عزيزا
en: And that Allah may help you with strong help.

source: هو الذي أنزل السكينة في قلوب المؤمنين ليزدادوا إيمانا مع إيمانهم ولله جنود السماوات والأرض وكان الله عليما حكيما
en: He it is Who sent down As-Sakinah (calmness and tranquillity) into the hearts of the believers, that they may grow more in Faith along with their (present) Faith. And to Allah belong the hosts of the heavens and the earth, and Allah is Ever All-Knower, All-Wise.

source: ليدخل المؤمنين والمؤمنات جنات تجري من تحتها الأنهار خالدين فيها ويكفر عنهم سيئاتهم وكان ذلك عند الله فوزا عظيما
en: That He may admit the believing men and the believing women to Gardens under which rivers flow (i.e. Paradise), to abide therein forever, and He may expiate from them their sins; and that is with Allah a supreme success,

source: ويعذب المنافقين والمنافقات والمشركين والمشركات الظانين بالله ظن السوء عليهم دائرة السوء وغضب الله عليهم ولعنهم وأعد لهم جهنم وساءت مصيرا
en: And that He may punish the Munafiqun (hypocrites), men and women, and also the Mushrikun men and women, who think evil thoughts about Allah: for them is a disgraceful torment. And the Anger of Allah is upon them, and He has cursed them and prepared Hell for them - and worst indeed is that destination.

source: ولله جنود السماوات والأرض وكان الله عزيزا حكيما
en: And to Allah belong the hosts of the heavens and the earth. And Allah is Ever All-Powerful, All-Wise.

source: إنا أرسلناك شاهدا ومبشرا ونذيرا
en: Verily, We have sent you (O Muhammad صلى الله عليه وسلم) as a witness, as a bearer of glad tidings, and as a warner .

source: لتؤمنوا بالله ورسوله وتعزروه وتوقروه وتسبحوه بكرة وأصيلا
en: In order that you (O mankind) may believe in Allah and His Messenger (صلى الله عليه وسلم), and that you assist and honour him (صلى الله عليه وسلم), and (that you) glorify (Allah's) praises morning and afternoon.

source: إن الذين يبايعونك إنما يبايعون الله يد الله فوق أيديهم فمن نكث فإنما ينكث على نفسه ومن أوفى بما عاهد عليه الله فسيؤتيه أجرا عظيما
en: Verily, those who give Bai'ah (pledge) to you (O Muhammad صلى الله عليه وسلم) they are giving Bai'ah (pledge) to Allah. The Hand of Allah is over their hands. Then whosoever breaks his pledge, breaks it only to his own harm; and whosoever fulfils what he has covenanted with Allah, He will bestow on him a great reward.

source: سيقول لك المخلفون من الأعراب شغلتنا أموالنا وأهلونا فاستغفر لنا يقولون بألسنتهم ما ليس في قلوبهم قل فمن يملك لكم من الله شيئا إن أراد بكم ضرا أو أراد بكم نفعا بل كان الله بما تعملون خبيرا
en: Those of the bedouins who lagged behind will say to you: "Our possessions and our families occupied us, so ask forgiveness for us." They say with their tongues what is not in their hearts. Say: "Who then has any power at all (to intervene) on your behalf with Allah, if He intends you hurt or intends you benefit? Nay, but Allah is Ever All-Aware of what you do.

source: بل ظننتم أن لن ينقلب الرسول والمؤمنون إلى أهليهم أبدا وزين ذلك في قلوبكم وظننتم ظن السوء وكنتم قوما بورا
en: "Nay, but you thought that the Messenger (صلى الله عليه وسلم) and the believers would never return to their families, and that was made fair-seeming in your hearts, and you did think an evil thought and you became a useless people going for destruction."

source: ومن لم يؤمن بالله ورسوله فإنا أعتدنا للكافرين سعيرا
en: And whosoever does not believe in Allah and His Messenger (Muhammad صلى الله عليه وسلم), then verily, We have prepared for the disbelievers a blazing Fire.

source: ولله ملك السماوات والأرض يغفر لمن يشاء ويعذب من يشاء وكان الله غفورا رحيما
en: And to Allah belongs the sovereignty of the heavens and the earth. He forgives whom He wills, and punishes whom He wills. And Allah is Ever Oft-Forgiving, Most Merciful.

source: سيقول المخلفون إذا انطلقتم إلى مغانم لتأخذوها ذرونا نتبعكم يريدون أن يبدلوا كلام الله قل لن تتبعونا كذلكم قال الله من قبل فسيقولون بل تحسدوننا بل كانوا لا يفقهون إلا قليلا
en: Those who lagged behind will say, when you set forth to take the spoils, "Allow us to follow you." They want to change Allah's Words. Say: "You shall not follow us; thus Allah has said beforehand." Then they will say: "Nay, you envy us." Nay, but they understand not except a little.

source: قل للمخلفين من الأعراب ستدعون إلى قوم أولي بأس شديد تقاتلونهم أو يسلمون فإن تطيعوا يؤتكم الله أجرا حسنا وإن تتولوا كما توليتم من قبل يعذبكم عذابا أليما
en: Say (O Muhammad صلى الله عليه وسلم) to the bedouins who lagged behind: "You shall be called to fight against a people given to great warfare, then you shall fight them, or they shall surrender. Then if you obey, Allah will give you a fair reward; but if you turn away as you did turn away before, He will punish you with a painful torment."

source: ليس على الأعمى حرج ولا على الأعرج حرج ولا على المريض حرج ومن يطع الله ورسوله يدخله جنات تجري من تحتها الأنهار ومن يتول يعذبه عذابا أليما
en: No blame or sin is there upon the blind, nor is there blame or sin upon the lame, nor is there blame or sin upon the sick (that they go not for fighting). And whosoever obeys Allah and His Messenger (Muhammad صلى الله عليه وسلم), He will admit him to Gardens beneath which rivers flow (Paradise); and whosoever turns back, He will punish him with a painful torment.

source: لقد رضي الله عن المؤمنين إذ يبايعونك تحت الشجرة فعلم ما في قلوبهم فأنزل السكينة عليهم وأثابهم فتحا قريبا
en: Indeed, Allah was pleased with the believers when they gave the Bai'ah (pledge) to you (O Muhammad صلى الله عليه وسلم) under the tree: He knew what was in their hearts, and He sent down As-Sakinah (calmness and tranquillity) upon them, and He rewarded them with a near victory.

source: ومغانم كثيرة يأخذونها وكان الله عزيزا حكيما
en: And abundant spoils that they will capture. And Allah is Ever All-Mighty, All-Wise.

source: وعدكم الله مغانم كثيرة تأخذونها فعجل لكم هذه وكف أيدي الناس عنكم ولتكون آية للمؤمنين ويهديكم صراطا مستقيما
en: Allah has promised you abundant spoils that you will capture, and He has hastened for you this, and He has restrained the hands of men from you: that it may be a sign for the believers, and that He may guide you to the Straight Path.

source: وأخرى لم تقدروا عليها قد أحاط الله بها وكان الله على كل شيء قديرا
en: And other (victories and much booty He promises you) which are not yet within your power; indeed Allah compasses them. And Allah is Ever Able to do all things.

source: ولو قاتلكم الذين كفروا لولوا الأدبار ثم لا يجدون وليا ولا نصيرا
en: And if those who disbelieve fight against you, they certainly would have turned their backs; then they would have found neither a Wali (protector, guardian) nor a helper.

source: سنة الله التي قد خلت من قبل ولن تجد لسنة الله تبديلا
en: That has been the Way of Allah already with those who passed away before. And you will not find any change in the Way of Allah.

source: وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة من بعد أن أظفركم عليهم وكان الله بما تعملون بصيرا
en: And He it is Who has withheld their hands from you and your hands from them in the midst of Makkah, after He had made you victors over them. And Allah is Ever the All-Seer of what you do.

source: هم الذين كفروا وصدوكم عن المسجد الحرام والهدي معكوفا أن يبلغ محله ولولا رجال مؤمنون ونساء مؤمنات لم تعلموهم أن تطئوهم فتصيبكم منهم معرة بغير علم ليدخل الله في رحمته من يشاء لو تزيلوا لعذبنا الذين كفروا منهم عذابا أليما
en: They are the ones who disbelieved (in the Oneness of Allah - Islamic Monotheism) and hindered you from Al-Masjid-al-Haram (at Makkah) and detained the sacrificial animals from reaching their place of sacrifice. Had there not been believing men and believing women whom you did not know, that you may kill them and on whose account a sin would have been committed by you without (your) knowledge, that Allah might bring into His Mercy whom He wills - if they (the believers and the disbelievers) had been apart, We verily would have punished those of them who disbelieved with painful torment.

source: إذ جعل الذين كفروا في قلوبهم الحمية حمية الجاهلية فأنزل الله سكينته على رسوله وعلى المؤمنين وألزمهم كلمة التقوى وكانوا أحق بها وأهلها وكان الله بكل شيء عليما
en: When those who disbelieve had put in their hearts pride and haughtiness - the pride and haughtiness of the time of ignorance, - then Allah sent down His Sakinah (calmness and tranquillity) upon His Messenger (صلى الله عليه وسلم) and upon the believers, and made them stick to the word of piety (i.e. none has the right to be worshipped but Allah); and they were well entitled to it and worthy of it. And Allah is the All-Knower of everything.

source: لقد صدق الله رسوله الرؤيا بالحق لتدخلن المسجد الحرام إن شاء الله آمنين محلقين رءوسكم ومقصرين لا تخافون فعلم ما لم تعلموا فجعل من دون ذلك فتحا قريبا
en: Indeed Allah shall fulfil the true vision which He showed to His Messenger (صلى الله عليه وسلم) [i.e. the Prophet صلى الله عليه وسلم saw a dream that he has entered Makkah along with his Companions, having their (head) hair shaved and cut short] in very truth. Certainly, you shall enter Al-Masjid-al-Haram, if Allah wills, secure, (some) having your heads shaved, and (some) having your head hair cut short, having no fear. He knew what you knew not, and He granted besides that a near victory.

source: هو الذي أرسل رسوله بالهدى ودين الحق ليظهره على الدين كله وكفى بالله شهيدا
en: He it is Who has sent His Messenger (Muhammad صلى الله عليه وسلم) with guidance and the religion of truth (Islam), that He may make it (Islam) superior to all religions. And All-Sufficient is Allah as a Witness.

source: محمد رسول الله والذين معه أشداء على الكفار رحماء بينهم تراهم ركعا سجدا يبتغون فضلا من الله ورضوانا سيماهم في وجوههم من أثر السجود ذلك مثلهم في التوراة ومثلهم في الإنجيل كزرع أخرج شطأه فآزره فاستغلظ فاستوى على سوقه يعجب الزراع ليغيظ بهم الكفار وعد الله الذين آمنوا وعملوا الصالحات منهم مغفرة وأجرا عظيما
en: Muhammad (صلى الله عليه وسلم) is the Messenger of Allah. And those who are with him are severe against disbelievers, and merciful among themselves. You see them bowing and falling down prostrate (in prayer), seeking Bounty from Allah and (His) Good Pleasure. The mark of them (i.e. of their Faith) is on their faces (foreheads) from the traces of prostration (during prayers). This is their description in the Taurat (Torah). But their description in the Injeel (Gospel) is like a (sown) seed which sends forth its shoot, then makes it strong, and becomes thick and it stands straight on its stem, delighting the sowers, that He may enrage the disbelievers with them. Allah has promised those among them who believe (i.e. all those who follow Islamic Monotheism, the religion of Prophet Muhammad صلى الله عليه وسلم till the Day of Resurrection) and do righteous good deeds, forgiveness and a mighty reward (i.e. Paradise).

source: يا أيها الذين آمنوا لا تقدموا بين يدي الله ورسوله واتقوا الله إن الله سميع عليم
en: O you who believe! Make not (a decision) in advance before Allah and His Messenger (صلى الله عليه وسلم), and fear Allah. Verily! Allah is All-Hearing, All-Knowing.

source: يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي ولا تجهروا له بالقول كجهر بعضكم لبعض أن تحبط أعمالكم وأنتم لا تشعرون
en: O you who believe! Raise not your voices above the voice of the Prophet (صلى الله عليه وسلم), nor speak aloud to him in talk as you speak aloud to one another, lest your deeds should be rendered fruitless while you perceive not.

source: إن الذين يغضون أصواتهم عند رسول الله أولئك الذين امتحن الله قلوبهم للتقوى لهم مغفرة وأجر عظيم
en: Verily, those who lower their voices in the presence of Allah's Messenger (صلى الله عليه وسلم), they are the ones whose hearts Allah has tested for piety. For them is forgiveness and a great reward.

source: إن الذين ينادونك من وراء الحجرات أكثرهم لا يعقلون
en: Verily those who call you from behind the dwellings, most of them have no sense.

source: ولو أنهم صبروا حتى تخرج إليهم لكان خيرا لهم والله غفور رحيم
en: And if they had patience till you could come out to them, it would have been better for them. And Allah is Oft-Forgiving, Most Merciful.

source: يا أيها الذين آمنوا إن جاءكم فاسق بنبإ فتبينوا أن تصيبوا قوما بجهالة فتصبحوا على ما فعلتم نادمين
en: O you who believe! If a Fasiq (liar - evil person) comes to you with any news, verify it, lest you should harm people in ignorance, and afterwards you become regretful for what you have done.

source: واعلموا أن فيكم رسول الله لو يطيعكم في كثير من الأمر لعنتم ولكن الله حبب إليكم الإيمان وزينه في قلوبكم وكره إليكم الكفر والفسوق والعصيان أولئك هم الراشدون
en: And know that among you there is the Messenger of Allah (صلى الله عليه وسلم). If he were to obey you (i.e. follow your opinions and desires) in much of the matter, you would surely be in trouble. But Allah has endeared the Faith to you and has beautified it in your hearts, and has made disbelief, wickedness and disobedience (to Allah and His Messenger صلى الله عليه وسلم) hateful to you. Such are they who are the rightly guided.

source: فضلا من الله ونعمة والله عليم حكيم
en: (This is) a Grace from Allah and His Favour. And Allah is All-Knowing, All-Wise.

source: وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما فإن بغت إحداهما على الأخرى فقاتلوا التي تبغي حتى تفيء إلى أمر الله فإن فاءت فأصلحوا بينهما بالعدل وأقسطوا إن الله يحب المقسطين
en: And if two parties or groups among the believers fall to fighting, then make peace between them both. But if one of them outrages against the other, then fight you (all) against the one that which outrages till it complies with the Command of Allah. Then if it complies, then make reconciliation between them justly, and be equitable. Verily! Allah loves those who are the equitable.

source: إنما المؤمنون إخوة فأصلحوا بين أخويكم واتقوا الله لعلكم ترحمون
en: The believers are nothing else than brothers (in Islamic religion). So make reconciliation between your brothers, and fear Allah, that you may receive mercy.

source: يا أيها الذين آمنوا لا يسخر قوم من قوم عسى أن يكونوا خيرا منهم ولا نساء من نساء عسى أن يكن خيرا منهن ولا تلمزوا أنفسكم ولا تنابزوا بالألقاب بئس الاسم الفسوق بعد الإيمان ومن لم يتب فأولئك هم الظالمون
en: O you who believe! Let not a group scoff at another group, it may be that the latter are better than the former. Nor let (some) women scoff at other women, it may be that the latter are better than the former. Nor defame one another, nor insult one another by nicknames. How bad is it to insult one's brother after having Faith [i.e. to call your Muslim brother (a faithful believer) as: "O sinner", or "O wicked"]. And whosoever does not repent, then such are indeed Zalimun (wrong-doers, etc.).

source: يا أيها الذين آمنوا اجتنبوا كثيرا من الظن إن بعض الظن إثم ولا تجسسوا ولا يغتب بعضكم بعضا أيحب أحدكم أن يأكل لحم أخيه ميتا فكرهتموه واتقوا الله إن الله تواب رحيم
en: O you who believe! Avoid much suspicion; indeed some suspicions are sins. And spy not, neither backbite one another. Would one of you like to eat the flesh of his dead brother? You would hate it (so hate backbiting) . And fear Allah. Verily, Allah is the One Who forgives and accepts repentance, Most Merciful.

source: يا أيها الناس إنا خلقناكم من ذكر وأنثى وجعلناكم شعوبا وقبائل لتعارفوا إن أكرمكم عند الله أتقاكم إن الله عليم خبير
en: O mankind! We have created you from a male and a female, and made you into nations and tribes, that you may know one another. Verily, the most honourable of you with Allah is that (believer) who has At-Taqwa [i.e. he is one of the Muttaqun (the pious. See V.2:2)]. Verily, Allah is All-Knowing, All-Aware.

source: قالت الأعراب آمنا قل لم تؤمنوا ولكن قولوا أسلمنا ولما يدخل الإيمان في قلوبكم وإن تطيعوا الله ورسوله لا يلتكم من أعمالكم شيئا إن الله غفور رحيم
en: The bedouins say: "We believe." Say: "You believe not but you only say, 'We have surrendered (in Islam),' for Faith has not yet entered your hearts. But if you obey Allah and His Messenger (صلى الله عليه وسلم), He will not decrease anything in reward for your deeds. Verily, Allah is Oft-Forgiving, Most Merciful."

source: إنما المؤمنون الذين آمنوا بالله ورسوله ثم لم يرتابوا وجاهدوا بأموالهم وأنفسهم في سبيل الله أولئك هم الصادقون
en: Only those are the believers who have believed in Allah and His Messenger, and afterward doubt not but strive with their wealth and their lives for the Cause of Allah. Those! They are the truthful.

source: قل أتعلمون الله بدينكم والله يعلم ما في السماوات وما في الأرض والله بكل شيء عليم
en: Say: "Will you inform Allah of your religion while Allah knows all that is in the heavens and all that is in the earth, and Allah is All-Aware of everything.

source: يمنون عليك أن أسلموا قل لا تمنوا علي إسلامكم بل الله يمن عليكم أن هداكم للإيمان إن كنتم صادقين
en: They regard as favour to you (O Muhammad صلى الله عليه وسلم) that they have embraced Islam. Say: "Count not your Islam as a favour to me. Nay, but Allah has conferred a favour upon you that He has guided you to the Faith if you indeed are true.

source: إن الله يعلم غيب السماوات والأرض والله بصير بما تعملون
en: Verily, Allah knows the Unseen of the heavens and the earth. And Allah is the All-Seer of what you do.

source: ق والقرآن المجيد
en: Qaf. [These letters (Qaf, etc.) are one of the miracles of the Qur'an, and none but Allah (Alone) knows their meanings]. By the Glorious Qur'an.

source: بل عجبوا أن جاءهم منذر منهم فقال الكافرون هذا شيء عجيب
en: Nay, they wonder that there has come to them a warner (Muhammad صلى الله عليه وسلم) from among themselves. So the disbelievers say: "This is a strange thing!

source: أإذا متنا وكنا ترابا ذلك رجع بعيد
en: "When we are dead and have become dust (shall we be resurrected?) That is a far return."
